app/graphql/types/query_type.rb

SELECT `charities`.* FROM `charities` WHERE (D) LIMIT 1
---
    def all_charities
      Charity.all

SELECT `charities`.* FROM `charities` WHERE `charities`.`category_id` = NULL LIMIT 1
---
    def charities_for_category(cat_id:)
      Charity.where(category_id: cat_id)